In [1]:
import pandas as pd
pd.read_csv('exam.csv')
pd.DataFrame({'x' : [1, 2, 3]})

   x
0  1
1  2
2  3

In [9]:
df = pd.read_csv('exam.csv')
df.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [11]:
var = [1, 2, 3]
var.head()

AttributeError: 'list' object has no attribute 'head'

In [13]:
type(df)

pandas.core.frame.DataFrame

In [15]:
type(var)

list

In [19]:
df.head() # method

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [21]:
df.shape # attribute

(20, 5)

In [23]:
var.shape

AttributeError: 'list' object has no attribute 'shape'